//一維数组，二維數組，字符数组
#include <stdio.h>
#include <string.h> 
int main(){
  // int arr[3] = {1,2,3};//第一种初始化
  // int arr1[3] = {1,2};//第二种初始化，没有给出的为0值
  // int arr2[] = {1,2,3};//第三种初始化
  // printf("arr = %d\n", arr[2] );
  // printf("arr1 = %d\n",arr1[0]);
  // printf("arr2 = %d\n",arr2[1]);

  // for(int i = 0;i < 3;++i)
  // {
  //   printf("%d\t",arr[i]);
  //   printf("\n");
  // }

  // int arr[3][4];//表示三行四列
  // arr[0][0] = 1;
  // arr[2][3] = 3;

  //二維數組在內存中可以看作大的一維數組
  // int arr[3][4] = {{1,2,3,4},{4,5,6,7},{7,8,9,10}};//數組的初始化，三種方式
  // int arr1[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};//可以按照一维数组方式赋值
  
  // int arr2[3][4] = {{1},{2},{3}};//给部分元素值，剩余的位0值
  // int arr2[3][4] = {1,2,3};
  
  // int arr3[][4] = {1,2,3,4,5,6,7,8,9,10,11,12,13};//给所有元素，可缺省最高维
  
  // for(int i = 0;i < 3;++i)
  // {
  //   for(int j = 0;j < 4;++j)
  //   {
  //     printf("%d\t",arr3[i][j]);
  //   }
  //   printf("\n");
  // }

  // for(int i = 0;i < 16;++i)//用花括号的元素个数去除列数，除不尽的整除后加一，多出的部分用0赋值
  // {
  //   printf("%d\n",arr3[i/4][i%4]);
  // }

  //c语言中用字符数组来表示字符串，字符串中用\0(内存数值是0)表示字符串结束
  //字符数组要比真正的字符集多一，多一个可以存放\0的位置
  char name[16] = {'A','b','\0','c','d'};//mothod 1
  char name1[16] = "addfdsjskfkdseee";//method 2,处数组的初始化外，字符数组可以直接使用字符串进行初始化
  
  char name2[3][16] = {"zhangsan","lisi","wangwu"};//字符二维数组，也是一维的字符串数组，数组的降维操作
   
  printf("%s\n",name2);//字符串的首地址
  // for(int i = 0;i < 16;++i)
  // {
  //   printf("%c\n",name[i]);
  // }
  
  //求数组内存大小
  printf("%d\n",sizeof(name2));//求数组
  //求字符串长度
  printf("%d\n",strlen(name));//求字符串，从下标0开始到\0以外该字符串中有多少个元素

  
  return 0;
}
