//一維数组，二維數組
#include <stdio.h>
int main(){
  // int arr[3] = {1,2,3};//第一种初始化
  // int arr1[3] = {1,2};//第二种初始化，没有给出的为0值
  // int arr2[] = {1,2,3};//第三种初始化
  // printf("arr = %d\n", arr[2] );
  // printf("arr1 = %d\n",arr1[0]);
  // printf("arr2 = %d\n",arr2[1]);

  // for(int i = 0;i < 3;++i)
  // {
  //   printf("%d\t",arr[i]);
  //   printf("\n");
  // }

  // int arr[3][4];//表示三行四列
  // arr[0][0] = 1;
  // arr[2][3] = 3;
  //二維數組在內存中可以看作大的一維數組
  // int arr[3][4] = {{1,2,3,4},{4,5,6,7},{7,8,9,10}};//數組的初始化，三種方式
  // int arr1[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};//可以按照一维数组方式赋值
  
  // int arr2[3][4] = {{1},{2},{3}};
  // int arr2[3][4] = {1,2,3};
  
  int arr3[][4] = {1,2,3,4,5,6,7,8,9,10,11,12,13};
  
  // for(int i = 0;i < 3;++i)
  // {
  //   for(int j = 0;j < 4;++j)
  //   {
  //     printf("%d\t",arr3[i][j]);
  //   }
  //   printf("\n");
  // }

  for(int i = 0;i < 16;++i)
  {
    printf("%d\n",arr3[i/4][i%4]);
  }
  return 0;
}
